MontyArchiveWebsite/app/controllers/interviews_controller.rb

SELECT `interviews`.* FROM `interviews`
---
  def index
	@interviews = Interview.all

SELECT  `interviews`.* FROM `interviews` WHERE `interviews`.`id` = 1 LIMIT 1
---
  def show
	@interview = Interview.find(params[:id])

INSERT INTO `interviews` (`title`, `description`, `created_at`, `updated_at`) VALUES ('title1', 'desc1', '2019-07-20 23:41:45', '2019-07-20 23:41:45')
---
  def create
	@interview = Interview.new(interview_params)

	@interview.save